marcusbirkin/-lighthack-KL46-SNES/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTE25 (number 32), U2[6]/U10[6]/I2C0_SDA
  @{ */
#define BOARD_ACCEL_SDA_PERIPHERAL I2C0               /*!<@brief Device name: I2C0 */
#define BOARD_ACCEL_SDA_SIGNAL SDA                    /*!<@brief I2C0 signal: SDA */
#define BOARD_ACCEL_SDA_PORT PORTE                    /*!<@brief PORT device name: PORTE */
#define BOARD_ACCEL_SDA_PIN 25U                       /*!<@brief PORTE pin index: 25 */
#define BOARD_ACCEL_SDA_PIN_NAME I2C0_SDA             /*!<@brief Pin name */
#define BOARD_ACCEL_SDA_LABEL "U2[6]/U10[6]/I2C0_SDA" /*!<@brief Label */
#define BOARD_ACCEL_SDA_NAME "ACCEL_SDA"              /*!<@brief Identifier name */
                                                      /* @} */

/*! @name PORTE24 (number 31), U2[7]/U10[4]/I2C0_SDA
  @{ */
#define BOARD_ACCEL_SCL_PERIPHERAL I2C0               /*!<@brief Device name: I2C0 */
#define BOARD_ACCEL_SCL_SIGNAL SCL                    /*!<@brief I2C0 signal: SCL */
#define BOARD_ACCEL_SCL_PORT PORTE                    /*!<@brief PORT device name: PORTE */
#define BOARD_ACCEL_SCL_PIN 24U                       /*!<@brief PORTE pin index: 24 */
#define BOARD_ACCEL_SCL_PIN_NAME I2C0_SCL             /*!<@brief Pin name */
#define BOARD_ACCEL_SCL_LABEL "U2[7]/U10[4]/I2C0_SDA" /*!<@brief Label */
#define BOARD_ACCEL_SCL_NAME "ACCEL_SCL"              /*!<@brief Identifier name */
                                                      /* @} */

/*! @name PORTC5 (number 81), U10[11]/INT1_ACCEL
  @{ */
#define BOARD_ACCEL_INT1_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_ACCEL_INT1_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_ACCEL_INT1_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_ACCEL_INT1_GPIO_PIN 5U                       /*!<@brief PORTC pin index: 5 */
#define BOARD_ACCEL_INT1_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_ACCEL_INT1_PIN 5U                            /*!<@brief PORTC pin index: 5 */
#define BOARD_ACCEL_INT1_CHANNEL 5                         /*!<@brief GPIOC GPIO channel: 5 */
#define BOARD_ACCEL_INT1_PIN_NAME PTC5                     /*!<@brief Pin name */
#define BOARD_ACCEL_INT1_LABEL "U10[11]/INT1_ACCEL"        /*!<@brief Label */
#define BOARD_ACCEL_INT1_NAME "ACCEL_INT1"                 /*!<@brief Identifier name */
#define BOARD_ACCEL_INT1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                           /* @} */

/*! @name PORTD1 (number 94), U2[9]/U10[9]/INT2_ACCEL
  @{ */
#define BOARD_ACCEL_INT2_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_ACCEL_INT2_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_ACCEL_INT2_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_ACCEL_INT2_GPIO_PIN 1U                       /*!<@brief PORTD pin index: 1 */
#define BOARD_ACCEL_INT2_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_ACCEL_INT2_PIN 1U                            /*!<@brief PORTD pin index: 1 */
#define BOARD_ACCEL_INT2_CHANNEL 1                         /*!<@brief GPIOD GPIO channel: 1 */
#define BOARD_ACCEL_INT2_PIN_NAME PTD1                     /*!<@brief Pin name */
#define BOARD_ACCEL_INT2_LABEL "U2[9]/U10[9]/INT2_ACCEL"   /*!<@brief Label */
#define BOARD_ACCEL_INT2_NAME "ACCEL_INT2"                 /*!<@brief Identifier name */
#define BOARD_ACCEL_INT2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCEL(void);

#define SOPT5_UART0ODE_DISABLED 0x00u  /*!<@brief UART0 Open Drain Enable: Open drain is disabled on UART0. */
#define SOPT5_UART0RXSRC_UART_RX 0x00u /*!<@brief UART0 Receive Data Source Select: UART_RX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART0 Transmit Data Source Select: UART0_TX pin */

/*! @name PORTA2 (number 36), J1[4]/D1/UART1_TX_TGTMCU
  @{ */
#define BOARD_DEBUG_UART_TX_PERIPHERAL UART0                   /*!<@brief Device name: UART0 */
#define BOARD_DEBUG_UART_TX_SIGNAL TX                          /*!<@brief UART0 signal: TX */
#define BOARD_DEBUG_UART_TX_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_DEBUG_UART_TX_PIN 2U                             /*!<@brief PORTA pin index: 2 */
#define BOARD_DEBUG_UART_TX_PIN_NAME UART0_TX                  /*!<@brief Pin name */
#define BOARD_DEBUG_UART_TX_LABEL "J1[4]/D1/UART1_TX_TGTMCU"   /*!<@brief Label */
#define BOARD_DEBUG_UART_TX_NAME "DEBUG_UART_TX"               /*!<@brief Identifier name */
#define BOARD_DEBUG_UART_TX_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                               /* @} */

