marcusbirkin/-lighthack-KL46-SNES/board/pin_mux.h
/*! @name PORTA1 (number 35), J1[2]/D0/UART1_RX_TGTMCU
  @{ */
#define BOARD_DEBUG_UART_RX_PERIPHERAL UART0                 /*!<@brief Device name: UART0 */
#define BOARD_DEBUG_UART_RX_SIGNAL RX                        /*!<@brief UART0 signal: RX */
#define BOARD_DEBUG_UART_RX_PORT PORTA                       /*!<@brief PORT device name: PORTA */
#define BOARD_DEBUG_UART_RX_PIN 1U                           /*!<@brief PORTA pin index: 1 */
#define BOARD_DEBUG_UART_RX_PIN_NAME UART0_RX                /*!<@brief Pin name */
#define BOARD_DEBUG_UART_RX_LABEL "J1[2]/D0/UART1_RX_TGTMCU" /*!<@brief Label */
#define BOARD_DEBUG_UART_RX_NAME "DEBUG_UART_RX"             /*!<@brief Identifier name */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UART(void);

/*! @name PORTC3 (number 73), SW1
  @{ */
#define BOARD_SW1_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_SW1_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_SW1_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_SW1_GPIO_PIN 3U                       /*!<@brief PORTC pin index: 3 */
#define BOARD_SW1_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_SW1_PIN 3U                            /*!<@brief PORTC pin index: 3 */
#define BOARD_SW1_CHANNEL 3                         /*!<@brief GPIOC GPIO channel: 3 */
#define BOARD_SW1_PIN_NAME PTC3                     /*!<@brief Pin name */
#define BOARD_SW1_LABEL "SW1"                       /*!<@brief Label */
#define BOARD_SW1_NAME "SW1"                        /*!<@brief Identifier name */
#define BOARD_SW1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                    /* @} */

/*! @name PORTC12 (number 88), SW3
  @{ */
#define BOARD_SW3_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_SW3_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_SW3_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_SW3_GPIO_PIN 12U                      /*!<@brief PORTC pin index: 12 */
#define BOARD_SW3_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_SW3_PIN 12U                           /*!<@brief PORTC pin index: 12 */
#define BOARD_SW3_CHANNEL 12                        /*!<@brief GPIOC GPIO channel: 12 */
#define BOARD_SW3_PIN_NAME PTC12                    /*!<@brief Pin name */
#define BOARD_SW3_LABEL "SW3"                       /*!<@brief Label */
#define BOARD_SW3_NAME "SW3"                        /*!<@brief Identifier name */
#define BOARD_SW3_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtons(void);

/*! @name PORTE29 (number 26), LED_RED
  @{ */
#define BOARD_LED_RED_PERIPHERAL GPIOE                   /*!<@brief Device name: GPIOE */
#define BOARD_LED_RED_SIGNAL GPIO                        /*!<@brief GPIOE signal: GPIO */
#define BOARD_LED_RED_GPIO GPIOE                         /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED_RED_GPIO_PIN 29U                       /*!<@brief PORTE pin index: 29 */
#define BOARD_LED_RED_PORT PORTE                         /*!<@brief PORT device name: PORTE */
#define BOARD_LED_RED_PIN 29U                            /*!<@brief PORTE pin index: 29 */
#define BOARD_LED_RED_CHANNEL 29                         /*!<@brief GPIOE GPIO channel: 29 */
#define BOARD_LED_RED_PIN_NAME PTE29                     /*!<@brief Pin name */
#define BOARD_LED_RED_LABEL "LED_RED"                    /*!<@brief Label */
#define BOARD_LED_RED_NAME "LED_RED"                     /*!<@brief Identifier name */
#define BOARD_LED_RED_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                         /* @} */

/*! @name PORTD5 (number 98), J2[12]/D13/LED_GREEN
  @{ */
#define BOARD_LED_GREEN_PERIPHERAL GPIOD                   /*!<@brief Device name: GPIOD */
#define BOARD_LED_GREEN_SIGNAL GPIO                        /*!<@brief GPIOD signal: GPIO */
#define BOARD_LED_GREEN_GPIO GPIOD                         /*!<@brief GPIO device name: GPIOD */
#define BOARD_LED_GREEN_GPIO_PIN 5U                        /*!<@brief PORTD pin index: 5 */
#define BOARD_LED_GREEN_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_LED_GREEN_PIN 5U                             /*!<@brief PORTD pin index: 5 */
#define BOARD_LED_GREEN_CHANNEL 5                          /*!<@brief GPIOD GPIO channel: 5 */
#define BOARD_LED_GREEN_PIN_NAME PTD5                      /*!<@brief Pin name */
#define BOARD_LED_GREEN_LABEL "J2[12]/D13/LED_GREEN"       /*!<@brief Label */
#define BOARD_LED_GREEN_NAME "LED_GREEN"                   /*!<@brief Identifier name */
#define BOARD_LED_GREEN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDs(void);

/*! @name PORTB16 (number 62), E1/TSI_ELECTRODE1
  @{ */
#define BOARD_TSI_ELECTRODE_1_PERIPHERAL TSI0           /*!<@brief Device name: TSI0 */
#define BOARD_TSI_ELECTRODE_1_SIGNAL CH                 /*!<@brief TSI0 signal: CH */
#define BOARD_TSI_ELECTRODE_1_PORT PORTB                /*!<@brief PORT device name: PORTB */
#define BOARD_TSI_ELECTRODE_1_PIN 16U                   /*!<@brief PORTB pin index: 16 */
#define BOARD_TSI_ELECTRODE_1_CHANNEL 9                 /*!<@brief TSI0 channel: 9 */
#define BOARD_TSI_ELECTRODE_1_PIN_NAME TSI0_CH9         /*!<@brief Pin name */
#define BOARD_TSI_ELECTRODE_1_LABEL "E1/TSI_ELECTRODE1" /*!<@brief Label */
#define BOARD_TSI_ELECTRODE_1_NAME "TSI_ELECTRODE_1"    /*!<@brief Identifier name */
                                                        /* @} */

