marcusbirkin/-lighthack-KL46-SNES/board/pin_mux.h
/*! @name PORTB17 (number 63), E1/TSI_ELECTRODE2
  @{ */
#define BOARD_TSI_ELECTRODE_2_PERIPHERAL TSI0           /*!<@brief Device name: TSI0 */
#define BOARD_TSI_ELECTRODE_2_SIGNAL CH                 /*!<@brief TSI0 signal: CH */
#define BOARD_TSI_ELECTRODE_2_PORT PORTB                /*!<@brief PORT device name: PORTB */
#define BOARD_TSI_ELECTRODE_2_PIN 17U                   /*!<@brief PORTB pin index: 17 */
#define BOARD_TSI_ELECTRODE_2_CHANNEL 10                /*!<@brief TSI0 channel: 10 */
#define BOARD_TSI_ELECTRODE_2_PIN_NAME TSI0_CH10        /*!<@brief Pin name */
#define BOARD_TSI_ELECTRODE_2_LABEL "E1/TSI_ELECTRODE2" /*!<@brief Label */
#define BOARD_TSI_ELECTRODE_2_NAME "TSI_ELECTRODE_2"    /*!<@brief Identifier name */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTouch(void);

/*! @name USB0_DM (number 11), J10[2]/USB_DM
  @{ */
#define BOARD_USB_DM_PERIPHERAL USB0       /*!<@brief Device name: USB0 */
#define BOARD_USB_DM_SIGNAL DM             /*!<@brief USB0 signal: DM */
#define BOARD_USB_DM_PIN_NAME USB0_DM      /*!<@brief Pin name */
#define BOARD_USB_DM_LABEL "J10[2]/USB_DM" /*!<@brief Label */
#define BOARD_USB_DM_NAME "USB_DM"         /*!<@brief Identifier name */
                                           /* @} */

/*! @name USB0_DP (number 10), J10[3]/USB_DP
  @{ */
#define BOARD_USB_DP_PERIPHERAL USB0       /*!<@brief Device name: USB0 */
#define BOARD_USB_DP_SIGNAL DP             /*!<@brief USB0 signal: DP */
#define BOARD_USB_DP_PIN_NAME USB0_DP      /*!<@brief Pin name */
#define BOARD_USB_DP_LABEL "J10[3]/USB_DP" /*!<@brief Label */
#define BOARD_USB_DP_NAME "USB_DP"         /*!<@brief Identifier name */
                                           /* @} */

/*! @name VREGIN (number 13), J7[2]/KL46Z_REGIN
  @{ */
#define BOARD_USB_VREGIN_PERIPHERAL USB0           /*!<@brief Device name: USB0 */
#define BOARD_USB_VREGIN_SIGNAL VREGIN             /*!<@brief USB0 signal: VREGIN */
#define BOARD_USB_VREGIN_PIN_NAME VREGIN           /*!<@brief Pin name */
#define BOARD_USB_VREGIN_LABEL "J7[2]/KL46Z_REGIN" /*!<@brief Label */
#define BOARD_USB_VREGIN_NAME "USB_VREGIN"         /*!<@brief Identifier name */
                                                   /* @} */

/*! @name VOUT33 (number 12), C11/VOUT33
  @{ */
#define BOARD_VOUT33_PERIPHERAL USB0    /*!<@brief Device name: USB0 */
#define BOARD_VOUT33_SIGNAL VOUT33      /*!<@brief USB0 signal: VOUT33 */
#define BOARD_VOUT33_PIN_NAME VOUT33    /*!<@brief Pin name */
#define BOARD_VOUT33_LABEL "C11/VOUT33" /*!<@brief Label */
#define BOARD_VOUT33_NAME "VOUT33"      /*!<@brief Identifier name */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSB(void);

/*! @name PORTB11 (number 61), DS1[12]/LCD-12
  @{ */
#define BOARD_LCD_12_PERIPHERAL LCD         /*!<@brief Device name: LCD */
#define BOARD_LCD_12_SIGNAL P               /*!<@brief LCD signal: P */
#define BOARD_LCD_12_PORT PORTB             /*!<@brief PORT device name: PORTB */
#define BOARD_LCD_12_PIN 11U                /*!<@brief PORTB pin index: 11 */
#define BOARD_LCD_12_CHANNEL 11             /*!<@brief LCD P channel: 11 */
#define BOARD_LCD_12_PIN_NAME LCD_P11       /*!<@brief Pin name */
#define BOARD_LCD_12_LABEL "DS1[12]/LCD-12" /*!<@brief Label */
#define BOARD_LCD_12_NAME "LCD_12"          /*!<@brief Identifier name */
                                            /* @} */

/*! @name PORTB10 (number 60), DS1[11]/LCD-11
  @{ */
#define BOARD_LCD_11_PERIPHERAL LCD         /*!<@brief Device name: LCD */
#define BOARD_LCD_11_SIGNAL P               /*!<@brief LCD signal: P */
#define BOARD_LCD_11_PORT PORTB             /*!<@brief PORT device name: PORTB */
#define BOARD_LCD_11_PIN 10U                /*!<@brief PORTB pin index: 10 */
#define BOARD_LCD_11_CHANNEL 10             /*!<@brief LCD P channel: 10 */
#define BOARD_LCD_11_PIN_NAME LCD_P10       /*!<@brief Pin name */
#define BOARD_LCD_11_LABEL "DS1[11]/LCD-11" /*!<@brief Label */
#define BOARD_LCD_11_NAME "LCD_11"          /*!<@brief Identifier name */
                                            /* @} */

/*! @name PORTC18 (number 92), DS1[10]/LCD-10
  @{ */
#define BOARD_LCD_10_PERIPHERAL LCD         /*!<@brief Device name: LCD */
#define BOARD_LCD_10_SIGNAL P               /*!<@brief LCD signal: P */
#define BOARD_LCD_10_PORT PORTC             /*!<@brief PORT device name: PORTC */
#define BOARD_LCD_10_PIN 18U                /*!<@brief PORTC pin index: 18 */
#define BOARD_LCD_10_CHANNEL 38             /*!<@brief LCD P channel: 38 */
#define BOARD_LCD_10_PIN_NAME LCD_P38       /*!<@brief Pin name */
#define BOARD_LCD_10_LABEL "DS1[10]/LCD-10" /*!<@brief Label */
#define BOARD_LCD_10_NAME "LCD_10"          /*!<@brief Identifier name */
                                            /* @} */

/*! @name PORTE5 (number 6), DS1[9]/LCD-09
  @{ */
#define BOARD_LCD_09_PERIPHERAL LCD        /*!<@brief Device name: LCD */
#define BOARD_LCD_09_SIGNAL P              /*!<@brief LCD signal: P */
#define BOARD_LCD_09_PORT PORTE            /*!<@brief PORT device name: PORTE */
#define BOARD_LCD_09_PIN 5U                /*!<@brief PORTE pin index: 5 */
#define BOARD_LCD_09_CHANNEL 53            /*!<@brief LCD P channel: 53 */
#define BOARD_LCD_09_PIN_NAME LCD_P53      /*!<@brief Pin name */
#define BOARD_LCD_09_LABEL "DS1[9]/LCD-09" /*!<@brief Label */
#define BOARD_LCD_09_NAME "LCD_09"         /*!<@brief Identifier name */
                                           /* @} */

/*! @name PORTB8 (number 58), DS1[8]/LCD-08
  @{ */
#define BOARD_LCD_08_PERIPHERAL LCD        /*!<@brief Device name: LCD */
#define BOARD_LCD_08_SIGNAL P              /*!<@brief LCD signal: P */
#define BOARD_LCD_08_PORT PORTB            /*!<@brief PORT device name: PORTB */
#define BOARD_LCD_08_PIN 8U                /*!<@brief PORTB pin index: 8 */
#define BOARD_LCD_08_CHANNEL 8             /*!<@brief LCD P channel: 8 */
#define BOARD_LCD_08_PIN_NAME LCD_P8       /*!<@brief Pin name */
#define BOARD_LCD_08_LABEL "DS1[8]/LCD-08" /*!<@brief Label */
#define BOARD_LCD_08_NAME "LCD_08"         /*!<@brief Identifier name */
                                           /* @} */

/*! @name PORTB7 (number 57), DS1[7]/LCD-07
  @{ */
#define BOARD_LCD_07_PERIPHERAL LCD        /*!<@brief Device name: LCD */
#define BOARD_LCD_07_SIGNAL P              /*!<@brief LCD signal: P */
#define BOARD_LCD_07_PORT PORTB            /*!<@brief PORT device name: PORTB */
#define BOARD_LCD_07_PIN 7U                /*!<@brief PORTB pin index: 7 */
#define BOARD_LCD_07_CHANNEL 7             /*!<@brief LCD P channel: 7 */
#define BOARD_LCD_07_PIN_NAME LCD_P7       /*!<@brief Pin name */
#define BOARD_LCD_07_LABEL "DS1[7]/LCD-07" /*!<@brief Label */
#define BOARD_LCD_07_NAME "LCD_07"         /*!<@brief Identifier name */
                                           /* @} */

