marcusbirkin/-lighthack-KL46-SNES/board/pin_mux.h
/*! @name PORTB21 (number 67), DS1[6]/LCD-06
  @{ */
#define BOARD_LCD_06_PERIPHERAL LCD        /*!<@brief Device name: LCD */
#define BOARD_LCD_06_SIGNAL P              /*!<@brief LCD signal: P */
#define BOARD_LCD_06_PORT PORTB            /*!<@brief PORT device name: PORTB */
#define BOARD_LCD_06_PIN 21U               /*!<@brief PORTB pin index: 21 */
#define BOARD_LCD_06_CHANNEL 17            /*!<@brief LCD P channel: 17 */
#define BOARD_LCD_06_PIN_NAME LCD_P17      /*!<@brief Pin name */
#define BOARD_LCD_06_LABEL "DS1[6]/LCD-06" /*!<@brief Label */
#define BOARD_LCD_06_NAME "LCD_06"         /*!<@brief Identifier name */
                                           /* @} */

/*! @name PORTC17 (number 91), DS1[5]/LCD-05
  @{ */
#define BOARD_LCD_05_PERIPHERAL LCD        /*!<@brief Device name: LCD */
#define BOARD_LCD_05_SIGNAL P              /*!<@brief LCD signal: P */
#define BOARD_LCD_05_PORT PORTC            /*!<@brief PORT device name: PORTC */
#define BOARD_LCD_05_PIN 17U               /*!<@brief PORTC pin index: 17 */
#define BOARD_LCD_05_CHANNEL 37            /*!<@brief LCD P channel: 37 */
#define BOARD_LCD_05_PIN_NAME LCD_P37      /*!<@brief Pin name */
#define BOARD_LCD_05_LABEL "DS1[5]/LCD-05" /*!<@brief Label */
#define BOARD_LCD_05_NAME "LCD_05"         /*!<@brief Identifier name */
                                           /* @} */

/*! @name PORTB22 (number 68), DS1[4]/LCD-04
  @{ */
#define BOARD_LCD_04_PERIPHERAL LCD        /*!<@brief Device name: LCD */
#define BOARD_LCD_04_SIGNAL P              /*!<@brief LCD signal: P */
#define BOARD_LCD_04_PORT PORTB            /*!<@brief PORT device name: PORTB */
#define BOARD_LCD_04_PIN 22U               /*!<@brief PORTB pin index: 22 */
#define BOARD_LCD_04_CHANNEL 18            /*!<@brief LCD P channel: 18 */
#define BOARD_LCD_04_PIN_NAME LCD_P18      /*!<@brief Pin name */
#define BOARD_LCD_04_LABEL "DS1[4]/LCD-04" /*!<@brief Label */
#define BOARD_LCD_04_NAME "LCD_04"         /*!<@brief Identifier name */
                                           /* @} */

/*! @name PORTB23 (number 69), DS1[3]/LCD-03
  @{ */
#define BOARD_LCD_03_PERIPHERAL LCD        /*!<@brief Device name: LCD */
#define BOARD_LCD_03_SIGNAL P              /*!<@brief LCD signal: P */
#define BOARD_LCD_03_PORT PORTB            /*!<@brief PORT device name: PORTB */
#define BOARD_LCD_03_PIN 23U               /*!<@brief PORTB pin index: 23 */
#define BOARD_LCD_03_CHANNEL 19            /*!<@brief LCD P channel: 19 */
#define BOARD_LCD_03_PIN_NAME LCD_P19      /*!<@brief Pin name */
#define BOARD_LCD_03_LABEL "DS1[3]/LCD-03" /*!<@brief Label */
#define BOARD_LCD_03_NAME "LCD_03"         /*!<@brief Identifier name */
                                           /* @} */

/*! @name PORTE4 (number 5), DS1[2]/LCD-02
  @{ */
#define BOARD_LCD_02_PERIPHERAL LCD        /*!<@brief Device name: LCD */
#define BOARD_LCD_02_SIGNAL P              /*!<@brief LCD signal: P */
#define BOARD_LCD_02_PORT PORTE            /*!<@brief PORT device name: PORTE */
#define BOARD_LCD_02_PIN 4U                /*!<@brief PORTE pin index: 4 */
#define BOARD_LCD_02_CHANNEL 52            /*!<@brief LCD P channel: 52 */
#define BOARD_LCD_02_PIN_NAME LCD_P52      /*!<@brief Pin name */
#define BOARD_LCD_02_LABEL "DS1[2]/LCD-02" /*!<@brief Label */
#define BOARD_LCD_02_NAME "LCD_02"         /*!<@brief Identifier name */
                                           /* @} */

/*! @name PORTD0 (number 93), DS1[1]/LCD-01
  @{ */
#define BOARD_LCD_01_PERIPHERAL LCD        /*!<@brief Device name: LCD */
#define BOARD_LCD_01_SIGNAL P              /*!<@brief LCD signal: P */
#define BOARD_LCD_01_PORT PORTD            /*!<@brief PORT device name: PORTD */
#define BOARD_LCD_01_PIN 0U                /*!<@brief PORTD pin index: 0 */
#define BOARD_LCD_01_CHANNEL 40            /*!<@brief LCD P channel: 40 */
#define BOARD_LCD_01_PIN_NAME LCD_P40      /*!<@brief Pin name */
#define BOARD_LCD_01_LABEL "DS1[1]/LCD-01" /*!<@brief Label */
#define BOARD_LCD_01_NAME "LCD_01"         /*!<@brief Identifier name */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSegment_LCD(void);

/*! @name PORTA19 (number 51), Y1[3]/XTAL_8MHZ
  @{ */
#define BOARD_XTAL0_PERIPHERAL OSC0         /*!<@brief Device name: OSC0 */
#define BOARD_XTAL0_SIGNAL XTAL0            /*!<@brief OSC0 signal: XTAL0 */
#define BOARD_XTAL0_PORT PORTA              /*!<@brief PORT device name: PORTA */
#define BOARD_XTAL0_PIN 19U                 /*!<@brief PORTA pin index: 19 */
#define BOARD_XTAL0_PIN_NAME XTAL0          /*!<@brief Pin name */
#define BOARD_XTAL0_LABEL "Y1[3]/XTAL_8MHZ" /*!<@brief Label */
#define BOARD_XTAL0_NAME "XTAL0"            /*!<@brief Identifier name */
                                            /* @} */

/*! @name PORTA18 (number 50), Y1[1]/EXTAL_8MHZ
  @{ */
#define BOARD_EXTAL0_PERIPHERAL OSC0          /*!<@brief Device name: OSC0 */
#define BOARD_EXTAL0_SIGNAL EXTAL0            /*!<@brief OSC0 signal: EXTAL0 */
#define BOARD_EXTAL0_PORT PORTA               /*!<@brief PORT device name: PORTA */
#define BOARD_EXTAL0_PIN 18U                  /*!<@brief PORTA pin index: 18 */
#define BOARD_EXTAL0_PIN_NAME EXTAL0          /*!<@brief Pin name */
#define BOARD_EXTAL0_LABEL "Y1[1]/EXTAL_8MHZ" /*!<@brief Label */
#define BOARD_EXTAL0_NAME "EXTAL0"            /*!<@brief Identifier name */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSC(void);

/*! @name PORTE25 (number 32), U2[6]/U10[6]/I2C0_SDA
  @{ */
#define BOARD_MAG_SDA_PERIPHERAL I2C0               /*!<@brief Device name: I2C0 */
#define BOARD_MAG_SDA_SIGNAL SDA                    /*!<@brief I2C0 signal: SDA */
#define BOARD_MAG_SDA_PORT PORTE                    /*!<@brief PORT device name: PORTE */
#define BOARD_MAG_SDA_PIN 25U                       /*!<@brief PORTE pin index: 25 */
#define BOARD_MAG_SDA_PIN_NAME I2C0_SDA             /*!<@brief Pin name */
#define BOARD_MAG_SDA_LABEL "U2[6]/U10[6]/I2C0_SDA" /*!<@brief Label */
#define BOARD_MAG_SDA_NAME "MAG_SDA"                /*!<@brief Identifier name */
                                                    /* @} */

/*! @name PORTE24 (number 31), U2[7]/U10[4]/I2C0_SDA
  @{ */
#define BOARD_MAG_SCL_PERIPHERAL I2C0               /*!<@brief Device name: I2C0 */
#define BOARD_MAG_SCL_SIGNAL SCL                    /*!<@brief I2C0 signal: SCL */
#define BOARD_MAG_SCL_PORT PORTE                    /*!<@brief PORT device name: PORTE */
#define BOARD_MAG_SCL_PIN 24U                       /*!<@brief PORTE pin index: 24 */
#define BOARD_MAG_SCL_PIN_NAME I2C0_SCL             /*!<@brief Pin name */
#define BOARD_MAG_SCL_LABEL "U2[7]/U10[4]/I2C0_SDA" /*!<@brief Label */
#define BOARD_MAG_SCL_NAME "MAG_SCL"                /*!<@brief Identifier name */
                                                    /* @} */

