marcusbirkin/-lighthack-KL46-SNES/board/pin_mux.h
/*! @name PORTD1 (number 94), U2[9]/U10[9]/INT2_ACCEL
  @{ */
#define BOARD_MAG_INT2_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_MAG_INT2_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_MAG_INT2_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_MAG_INT2_GPIO_PIN 1U                       /*!<@brief PORTD pin index: 1 */
#define BOARD_MAG_INT2_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_MAG_INT2_PIN 1U                            /*!<@brief PORTD pin index: 1 */
#define BOARD_MAG_INT2_CHANNEL 1                         /*!<@brief GPIOD GPIO channel: 1 */
#define BOARD_MAG_INT2_PIN_NAME PTD1                     /*!<@brief Pin name */
#define BOARD_MAG_INT2_LABEL "U2[9]/U10[9]/INT2_ACCEL"   /*!<@brief Label */
#define BOARD_MAG_INT2_NAME "MAG_INT2"                   /*!<@brief Identifier name */
#define BOARD_MAG_INT2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitMAG(void);

/*! @name PORTC8 (number 84), J1[14]/D6
  @{ */
#define BOARD_INITSNES_SNES_CLK_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITSNES_SNES_CLK_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITSNES_SNES_CLK_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITSNES_SNES_CLK_GPIO_PIN 8U                        /*!<@brief PORTC pin index: 8 */
#define BOARD_INITSNES_SNES_CLK_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITSNES_SNES_CLK_PIN 8U                             /*!<@brief PORTC pin index: 8 */
#define BOARD_INITSNES_SNES_CLK_CHANNEL 8                          /*!<@brief GPIOC GPIO channel: 8 */
#define BOARD_INITSNES_SNES_CLK_PIN_NAME PTC8                      /*!<@brief Pin name */
#define BOARD_INITSNES_SNES_CLK_LABEL "J1[14]/D6"                  /*!<@brief Label */
#define BOARD_INITSNES_SNES_CLK_NAME "SNES_CLK"                    /*!<@brief Identifier name */
#define BOARD_INITSNES_SNES_CLK_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PORTC9 (number 85), J1[16]/D7
  @{ */
#define BOARD_INITSNES_SNES_LAT_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITSNES_SNES_LAT_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITSNES_SNES_LAT_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITSNES_SNES_LAT_GPIO_PIN 9U                        /*!<@brief PORTC pin index: 9 */
#define BOARD_INITSNES_SNES_LAT_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITSNES_SNES_LAT_PIN 9U                             /*!<@brief PORTC pin index: 9 */
#define BOARD_INITSNES_SNES_LAT_CHANNEL 9                          /*!<@brief GPIOC GPIO channel: 9 */
#define BOARD_INITSNES_SNES_LAT_PIN_NAME PTC9                      /*!<@brief Pin name */
#define BOARD_INITSNES_SNES_LAT_LABEL "J1[16]/D7"                  /*!<@brief Label */
#define BOARD_INITSNES_SNES_LAT_NAME "SNES_LAT"                    /*!<@brief Identifier name */
#define BOARD_INITSNES_SNES_LAT_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PORTA13 (number 43), J2[2]/D8
  @{ */
#define BOARD_INITSNES_SNES_DATA_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_INITSNES_SNES_DATA_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_INITSNES_SNES_DATA_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITSNES_SNES_DATA_GPIO_PIN 13U                      /*!<@brief PORTA pin index: 13 */
#define BOARD_INITSNES_SNES_DATA_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_INITSNES_SNES_DATA_PIN 13U                           /*!<@brief PORTA pin index: 13 */
#define BOARD_INITSNES_SNES_DATA_CHANNEL 13                        /*!<@brief GPIOA GPIO channel: 13 */
#define BOARD_INITSNES_SNES_DATA_PIN_NAME PTA13                    /*!<@brief Pin name */
#define BOARD_INITSNES_SNES_DATA_LABEL "J2[2]/D8"                  /*!<@brief Label */
#define BOARD_INITSNES_SNES_DATA_NAME "SNES_DATA"                  /*!<@brief Identifier name */
#define BOARD_INITSNES_SNES_DATA_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                   /* @} */

/*!
 * @brief Config pins for SNES controller
 *
 */
void BOARD_InitSnes(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
